
* AOC 2023 Day 11

** Initialize 
#+BEGIN_SRC elisp
  (pyvenv-activate "~/projects/project_venv/")
  ; This is needed to make sure python indentation isn't messed up
  (setq org-src-preserve-indentation t)
#+END_SRC

#+RESULTS:
: t

** Day 11 star 1
*** Problem statement
*** Notes
- Load galaxy
- expand rows/columns with no galaxies
- breckenham's distance
*** Solution
#+BEGIN_SRC python :results output
from d11_utils import Grid,load_grid, dump_grid

def star_1(path: str) -> int:
  with open(path,'r') as f:
     grid = load_grid(path)
     grid.expand_size(2)
     galaxies = grid.find('#')
     s = 0

     for i1, p1 in enumerate(galaxies):
       for i2 in range(i1+1,len(galaxies)):
         p2 = galaxies[i2]
         if p1 != p2:
             d = grid.grid_distance(p1,p2)
             s += d

  return s
  
print(star_1("input.txt"))
#+END_SRC

#+RESULTS:
: 9274989

** Day 11 star 2
*** Problem statement
*** Notes
- Can't work around expanded rows/columns
- They just affect the size
  
*** Solution
#+BEGIN_SRC python :results output
from d11_utils import Grid,load_grid, dump_grid
def star_2(path: str) -> int:
  with open(path,'r') as f:
     grid = load_grid(path)
     grid.expand_size(10)
     galaxies = grid.find('#')
     s = 0

     for i1, p1 in enumerate(galaxies):
       for i2 in range(i1+1,len(galaxies)):
         p2 = galaxies[i2]
         if p1 != p2:
             d = grid.grid_distance(p1,p2)
             s += d

  return s
  
print("Star 2:", star_2("input.txt"))
#+END_SRC

#+RESULTS:
: Star 2: 12131997

